app/views/books/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."book_id" = ?  [["book_id", 1]]
---
                <%= link_to book_likes_path(book), method: :delete do %>
                <i class="fas fa-heart"><%= book.likes.count %></i>

SELECT COUNT(*) FROM "likes" WHERE "likes"."book_id" = ?  [["book_id", 1]]
---
                <%= link_to book_likes_path(book), method: :post do %>
                <i class="far fa-heart"><%= book.likes.count %></i>