app/views/books/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."book_id" = ?  [["book_id", 2]]
---
                <%= link_to book_likes_path(@user_book), method: :delete do %>
                <i class="fas fa-heart"><%= @user_book.likes.count %></i>

SELECT COUNT(*) FROM "likes" WHERE "likes"."book_id" = ?  [["book_id", 2]]
---
                <%= link_to book_likes_path(@user_book), method: :post do %>
                <i class="far fa-heart"><%= @user_book.likes.count %></i>