app/controllers/book_comments_controller.rb

  def create
    @book_comment = current_user.book_comments.new(comment_params)
    if @book_comment.save
---
INSERT INTO "book_comments" ("content", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "コメ"], ["user_id", 2], ["book_id", 1], ["created_at", "2021-08-07 03:25:33.285112"], ["updated_at", "2021-08-07 03:25:33.285112"]]

  def destroy
    @book_comment = BookComment.find_by(params[:id], user_id: current_user.id)
    @book_comment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE (1) LIMIT ?  [["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]