app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "えび"], ["body", "えび１"], ["user_id", 1], ["created_at", "2021-08-06 15:11:21.234782"], ["updated_at", "2021-08-06 15:11:21.234782"]]
---
  def create
    @user = current_user
    @books = Book.all
    @book = Book.new(book_params)
    @book.user_id = current_user.id

    if @book.save

SELECT "books".* FROM "books"
---
  def index
    @user = current_user
    @book = Book.new
    @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @user_book = Book.find(params[:id])
    @user = @user_book.user
    @like = Like.new
    @book_comments = @user_book.book_comments.all