app/controllers/likes_controller.rb

INSERT INTO "likes" ("book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 2], ["user_id", 2], ["created_at", "2021-08-07 02:16:19.667626"], ["updated_at", "2021-08-07 02:16:19.667626"]]
---
  def create
    @like = current_user.likes.create(book_id: params[:book_id])

SELECT  "likes".* FROM "likes" WHERE "likes"."book_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["book_id", 2], ["user_id", 2], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def destroy
    @like = Like.find_by(book_id: params[:book_id], user_id: current_user.id)
    @like.destroy