app/controllers/users_controller.rb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @user_book = Book.where(user_id:params[:id])
    @user = User.find(params[:id])

SELECT "users".* FROM "users"
---
  def index
    @user = current_user
    @book = Book.new
    @users = User.all