app/models/user.rb

SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."book_id" = ? LIMIT ?  [["user_id", 3], ["book_id", 1], ["LIMIT", 1]]
---
  def already_liked?(book)
    self.likes.exists?(book_id: book.id)